Revit 2027 API
SpotLightDistribution(SpotLightDistribution) Constructor
 Creates a copy of the given spotlight distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotLightDistribution(
	SpotLightDistribution other
)
Public Sub New (
	other As SpotLightDistribution
)
public:
SpotLightDistribution(
	SpotLightDistribution^ other
)
new :
        other : SpotLightDistribution -> SpotLightDistribution
Parameters
other SpotLightDistribution
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace